Array

Array คือ กลุ่มของตัวแปรที่ค่าหลายค่า และเป็นประเภทเดียวกัน เช่นคะแนนของนิสิต

การประกาศตัวแปร array ทำได้ 3 แบบ คือ 
1. int number[] = {3 , 4 , 5 , 6 , 7} ; // ต้องกำหนดขนาดเสมอ , อันนี้ alley มีขนาด 5
2. int number[100] ; // อันนี้ alley มีขนาด 100
3. int number[100] ; {3 , 4 , 5 , 6 , 7} ; //อันนี้ alley มีขนาด 100 แต่กำหนดค่าเริ่มต้นแค่ 5 ตัวแรก

ในแต่ละค่าใน array จะมีเบอร์ประจำตัว เรียกว่า index ซึ่ง หมายเลข index นั้นจะเริ่มตั้งแต่ 0 ถึง n-1 
การเรียกใช้
int num[10] //ประกาศว่าตัวแปร num มีประเภทเป็น int ที่มีขนาด 10 ตัว
ืีnum[0] = 2 ; //  เป็นการบอกว่า ค่าแรก มีค่าเท่ากับ 2 

สามารถไปประยุกต์ใช้กับ loop ได้ เช่น  
    for (i = 0; i < 10; i++) ซึ่งค่า i แทนหมายเลข index 
    {
        num[i] = 2
    }
เราสามารถกำหนดขนาดจากค่า define ได้ เช่น
define arraysize 5
num[arraysize] จากตรงนี้จะเปลี่ยนคำว่า arraysize เป็น 5 ทั้งหมด

const คือการที่จะให้ค่าคงตลอดทั้งโปรแกรม เช่น
const int a = 5 
เราไม่สามารถเปลี่ยนค่า a ได้ 

array 2 มิติ (array ซ้อน array)
การประกาศ เช่น  int a[1][2] โดย array แรกจะเป็นความกว้าของแถวแนวนอน และ arrayที่สองจะเป็นความยาวของแถวแนวนอน



